Makro/Pruebas/Prueba 17.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:OnlineGeneration>
         <!--Optional:-->
         <tem:ruc>900059238</tem:ruc>
         <!--Optional:-->
         <tem:Login/>
         <!--Optional:-->
         <tem:clave>88833C6E-AD43-4E7D-9A9F-132199692827</tem:clave>
         <!--Optional:-->
         <tem:docTxt>EN|01|F|SETT|4001142|2022-03-23|15:13:00|COP||1|31|900059238|MAKRO|MAKRO SUPERMAYORISTA S.A.S|23001|||MONTERIA|23||Cra.  14  No.  48 A 42 |CO|48|2|13|78709109|OSCAR LUIS DIAZ PATERNINA|OSCAR LUIS DIAZ PATERNINA||||||MONTERIA|CR 16 A 41 40|CO|49|833568.93|833568.93|902101.00|0.00|0.00|0.00|902101.00
ENEX|UBL 2.1|10|||||||2022-02-10||15:13:00||4690;4649;4711;4731|es|es|5|23001|MONTERIA|CORDOBA|23|Cra.  14  No.  48 A 42 |CO|Colombia||13|||23001|MONTERIA|CORDOBA|23|CR 16 A 41 40|CO|Colombia||13|14|16FD|01552666|23|Colombia|23001|CORDOBA|Colombia|23|111711|111711
RS|2019-01-19|2030-01-19|SETT|1|50000000||18760000001
DE|1|133993|C62|1.00|14453.78|13008.40||0.00||false
DEDI|CJA ORGDRA PLUS MERY ESTRA 16l
DEDI|15480.00
DEDIEX||999|1|||
DEIM|2471.60|13008.40|2471.60|19.00|01|IVA||C62|2471.60
DEDR|false|1445.38|10.00|||14453.78
DE|2|124097|C62|1.00|22184.87|22184.87||0.00||false
DEDI|CRE CORP LUBRIDERM EXTHUM400ml
DEDI|26400.00
DEDIEX||999|1|||
DEIM|4215.13|22184.87|4215.13|19.00|01|IVA||C62|4215.13
DE|3|260377|BG|1.00|11344.54|11344.54||0.00||false
DEDI|PAPAS MARGARITA NATURAL 25gX12u
DEDI|13500.00
DEDIEX||999|1|||
DEIM|2155.46|11344.54|2155.46|19.00|01|IVA||BG|2155.46
DE|4|122864|C62|3.00|1512.61|4537.82||0.00||false
DEDI|BEBIDA SPORADE TROPICAL 500ml
DEDI|5400.00
DEDIEX||999|1|||
DEIM|862.19|4537.82|862.19|19.00|01|IVA||C62|287.40
DE|5|114921|C62|2.00|2941.18|5378.15||0.00||false
DEDI|BOLIQUESO CHEETOS HORNEADOS 160g
DEDI|6400.00
DEDIEX||999|1|||
DEIM|1021.85|5378.15|1021.85|19.00|01|IVA||C62|510.93
DEDR|false|504.20|8.57|||5882.35
DE|6|579202|C62|2.00|97305.71|194611.43||0.00||false
DEDI|WKY OLD PARR 12 ANOS  750ml
DEDI|204342.00
DEDIEX||999|1|||
DEIM|9730.57|194611.43|9730.57|5.00|01|IVA||C62|4865.28
DE|7|579761|C62|2.00|28029.00|56058.00||||false
DEDI|IMPOCONSUMO ITEM 579202
DEDI|56058.00
DEIM|0.00|56058.00|0.00|0.00|01|IVA||C62|0.00
DE|8|77265|BO|5.00|36405.71|172229.52||0.00||false
DEDI|RON MEDELLIN 8 ANOS BOT 750ML
DEDI|180841.00
DEDIEX||999|1|||
DEIM|8611.48|172229.52|8611.48|5.00|01|IVA||BO|1722.30
DEDR|false|9799.05|5.38|||182028.57
DE|9|77670|BO|5.00|17238.00|86190.00||||false
DEDI|IMPOCONSUMO ITEM 077265
DEDI|86190.00
DEIM|0.00|86190.00|0.00|0.00|01|IVA||BO|0.00
DE|10|119805|PA|8.00|9411.76|75294.12||0.00||false
DEDI|CERVEZA AGUILA LIGHT LA 330ccX6u
DEDI|89600.00
DEDIEX||999|1|||
DEIM|14305.88|75294.12|14305.88|19.00|01|IVA||PA|1788.24
DE|11|119689|PA|8.00|2507.00|20056.00||||false
DEDI|IMPOCONSUMO ITEM 119805
DEDI|20056.00
DEIM|0.00|20056.00|0.00|0.00|01|IVA||PA|0.00
DE|12|132374|PA|16.00|8275.63|132410.08||0.00||false
DEDI|CERVZ LAT ORGNL AGUILA 330mlX6u
DEDI|157568.00
DEDIEX||999|1|||
DEIM|25157.92|132410.08|25157.92|19.00|01|IVA||PA|1572.37
DE|13|132376|PA|16.00|2251.00|36016.00||||false
DEDI|IMPOCONSUMO ITEM 132374
DEDI|36016.00
DEIM|0.00|36016.00|0.00|0.00|01|IVA||PA|0.00
DE|14|126653|C62|10.00|500.00|4250.00||0.00||false
DEDI|PAN ROLLO ARO 53g
DEDI|4250.00
DEDIEX||999|1|||
DEIM|0.00|4250.00|0.00|0.00|01|IVA||C62|0.00
DEDR|false|750.00|15.00|||5000.00
DIT|68531.63
DI||202570.00|0.00|0.00|01|0.00|IVA||
DI||264158.42|50189.58|19.00|01|50189.58|IVA||
DI||366840.95|18342.05|5.00|01|18342.05|IVA||
FP|1|49|2022-02-10|2216017569822
PE|Plantilla|T01_MBS.jasper
PE|CodigoBarras|220411261516010380082
PE|PPLTienda|ST16
PE|PPLCaja|1
PE|prom|0
PE|zona|N/A
PE|idInterno|1 2022041126
PE|CentroDistribucion|MAKRO MONTERIA
PE|DirCentroDistribucion|Cra.  14  No.  48 A 42 
PE|TelCentroDistribucion|N/A
PE|CorreoDist|no tiene
PE|PasaporteCliente|16-177918
PE|BarrioCliente|MONTERIA
PE|TelefonoCliente|N/A
PE|vrPuntosCMR|0.00
PE|vrEfectivo|0.00
PE|vrTdebito|902101.00
PE|vrCheque|0.00
PE|vrChequePost|0.00
PE|vrBonos|0.00
PE|vrTcredito|0.00
PE|vrTprivada|0.00
PE|vrNotaCredito|0.00
PE|vrCreditoDirecto|0.00
PE|vrDonacion|0.00
PE|vrCambio|0.00
PE|PuntosCMR|4458
PE|CorteCMR|09/02/2022
PE|Caja|1 38
PE|TotalArticulos|49
PE|TextoFecha|10-02-2022     15:16     1601 2022041126
PES|CentroDist
PESD|1|MAKRO MONTERIA
PESD|2|Cra.  14  No.  48 A 42 
PES|ResolucionesFactura
PESD|1|AGENTE RETENEDOR IVA RES.00812 30/1/2006
PESD|2|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|3|AUTORETENEDORES DEL IMPUESTO DE RENTA SEGUN RESOL No 1524 DE FEB 20 DE 2006
PES|Regimen
PESD|1|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|2| AUTORETENEDORES DEL IMPUESTO DE RENTA  
PESD|3| SEGUN RESOL No 1524 DE FEB 20 DE 2006  
PESD|4|        AGENTE RETENEDOR DE IVA         
PESD|5|      RESOLUCION 00812 30/01/2006       
PESD|6|
PESD|7|
PESD|8|
PES|CambioMercancia
PESD|1|(*)BIENES EXENTOS - DECRETO 417 DE 2020       CAMBIOS DENTRO DE LOS 7 DIAS HABILES A   PARTIR DE LA COMPRA,PRESENTA LA FACTURA 
PES|Falabella
PESD|1|Gracias por tu visita
PESD|2|
PESD|3|
CTE||||dte_9000592385@dte.paperless.com.co|
CTR||||no tiene|
TRE|O-13;O-15|IVA|01
TRR|R-99-PN|IVA|01</tem:docTxt>
         <!--Optional:-->
         <tem:tipoFoliacion>1</tem:tipoFoliacion>
         <!--Optional:-->
         <tem:tipoRetorno>5</tem:tipoRetorno>
      </tem:OnlineGeneration>
   </soapenv:Body>
</soapenv:Envelope>